{  
  "motivation": "My research interests are primarily focused in the discipline of the Forensic Sciences. My current focus is towards forensic validation generally, digital and media forensics specifically, and the nature of science philosophically. I have strong interests in all types of media including visual and audio and apply this to current and emerging issues within cybersecurity, intelligence, and forensic science.\n\nDuring my MBA at the University of Adelaide, I was introduced to the concept of ensuring our skills were employed solving the right problems faced within our modern world. Pedophilia, human trafficking, and abuse inflicted against children are some of the most abhorrent crimes known to our modern society. The technological revolution that was ushered in with the internet disrupted all industries, including our ability to combat these vile crimes. In my work, I continue building towards systems that will automatically detect, filter, and disrupt online abuse in all its forms.\n\nMy take on this work is unique due to the integration of systems thinking. I ensure my tools are built with the forensic process in mind, ensuring that not only is abhorrent media eliminated from our networks, but evidence of the crime is preserved leading to successful prosecution. However, breaking a single link is not enough. To completely eradicate the problem of online abuse and human trafficking, measures need to be taken to disrupt the system at all possible intervention points. On one hand, my work focuses on the detection, moderation, classification, and storage of online abuse material. On another, it studies the methods of analysis, categorization, linkage, and provenance of online abuse and surveillance material. Through the integration of systems thinking, these tools create leverage to disrupt at the critical point of dissemination and creation. Such disruption leads to a greater ability in locating those who are victims of these crimes.\n\nI acknowledge that my own work is not enough to solve the issues recognized by the systems-level analysis of the problem. Recognizing the limitations technology has, through international and interdisciplinary collaborations, the human, psychological, and criminological elements of these challenges become clear leading to victim-centric reforms, educational programs, and cultural changes to eliminate the socioeconomic factors leading to environments which cater to online abuse."  
}  